Repository: k0perX-X/course_work_2_flutter
Catalog: lib/l10n/intl_*.arb
Languages: ru

# addMedicineEnterDateOfManuf
source: Select a production date:
ru: Выберите дату производства:

# addMedicineSaveErrorNote
source: Save error. If the error persists, please try again later.
ru: Ошибка сохранения. Если ошибка повторяется, попробуйте позже.

# addMedicineSaveErrorTitle
source: Error
ru: Ошибка

# addMedicineTitle
source: Add medication
ru: Добавить лекарство

# appTitle
source: Patient Application
ru: Приложение пациента

# healthStatusNote
source: Describe your condition
ru: Опишите своё состояние

# healthStatusTemperature
source: Body temperature
ru: Температура тела

# healthStatusTitle
source: Health information
ru: Информация о здоровье

# homeHealthStatusButton
source: Add health information
ru: Добавить информацию о состоянии здоровья

# homePatientDoctorsAppointmentLoading
source: Load doctor appointments records
ru: Загрузка записей ко врачу

# homePatientDoctorsAppointmentLoadingError
source: Error loading upcoming doctor appointments
ru: Ошибка загрузки предстоящих записей ко врачу

# homePatientDoctorsAppointmentTitle
source: Upcoming doctor appointments
ru: Предстоящие записи ко врачу

# homePatientDoctorsAppointmentZeroElementLoaded
source: No records
ru: Записи отсутствуют

# homePatientProcedureLoading
source: Loading Procedures
ru: Загрузка процедур

# homePatientProcedureLoadingError
source: Error loading upcoming procedures
ru: Ошибка загрузки предстоящих процедур

# homePatientProcedureTitle
source: Upcoming procedures
ru: Предстоящие процедуры

# homePatientProcedureZeroElementLoaded
source: No records
ru: Записи отсутствуют

# loginErrorNote
source: An error occurred while logging in. Check the correctness of the entered data and try again.
ru: Произошла ошибка при входе. Проверьте корректность введенных данных и попробуйте снова.

# loginErrorTitle
source: Error
ru: Ошибка

# loginSingIn
source: Sing in
ru: Войти

# loginWelcomeTitle
source: Welcome
ru: Добро пожаловать

# medicineFloatingButton
source: Add medication
ru: Добавить лекарство

# medicineInstruction
source: Take in the {time} {meals}
ru: Принимать {time} {meals}

# medicineLoadError
source: Medicine data loading error
ru: Ошибка загрузки данных о лекарствах

# medicineLoading
source: Drug's information loading
ru: Загрузка данных о лекарствах

# medicineReceptionTimeDuringTheDay
source: afternoon
ru: днем

# medicineReceptionTimeInTheEvening
source: evening
ru: вечером

# medicineReceptionTimeInTheMorning
source: morning
ru: утром

# medicineRunningOutMedication
source: {remaining} left, but {leftToTake} prescribed
ru: Осталось {remaining}, но прописано {leftToTake}

# medicineTakeAfterMeals
source: after meals
ru: после еды

# medicineTakeBeforeMeals
source: before meals
ru: до еды

# medicineTakeRunningOutMedicationErrorNote
source: Add a drug to the list of available
ru: Добавьте лекарство в список имеющихся

# medicineTakeRunningOutMedicationErrorTitle
source: Not enough doses
ru: Недостаточное количество доз

# medicineTakeWithMeals
source: with meals
ru: с едой

# medicineWillGoBad
source: Expiration date: {date} {remaining} doses left
ru: Срок годности: {date} Осталось: {remaining} доз

# navBarHome
source: Home
ru: Дом

# navBarMedicine
source: Medicine
ru: Лекарства

# navBarSettings
source: Settings
ru: Настройки

# settingsSignOut
source: Sing out
ru: Выйти из аккаунта

# settingsUserTitle
source: Authorized as
ru: Авторизирован как

# takeMedicineCloseButton
source: Close
ru: Закрыть

# takeMedicineDrugsRemaining
source: You'll have {doses} doses left
ru: У вас останется {doses} доз

# takeMedicineSaveButton
source: Save
ru: Сохранить

# takeMedicineSaveErrorNote
source: Try to reduce the number of doses you take
ru: Попробуйте уменьшить количество принятых доз лекарства

# takeMedicineSaveErrorTitle
source: Error
ru: Ошибка
